/* -------------------------------------------------------------------------------
	+ - += ?= %=などの基本演算オペレータを提供
---------------------------------------------------------------------------------*/

#ifndef HPP_CALCRATABLE_INCLUDED
#define HPP_CALCRATABLE_INCLUDED

namespace nd {

// =================================================================
//	calcratable
template <typename T>
class Calcratable
{
	// *************************************************************************
	//	計算用データ取得
	virtual T& getCalcrateData() = 0;


	// *************************************************************************
	//
	
	
	
	
};


} // namespace nd

#endif // HPP_CALCRATABLE_INCLUDED
