/* -------------------------------------------------------------------------------
	コピー禁止ポリシークラス

---------------------------------------------------------------------------------*/

#ifndef HPP_NONCOPYABLE_INCLUDED
#define HPP_NONCOPYABLE_INCLUDED

#include <iostream>

namespace nd {

// =================================================================
//	コピー禁止クラスインターフェース
//		コンパイラによって暗黙に生成されるデフォルトコンストラクタ
//		コピーコンストラクタなどを非公開で明示的に定義する
class NonCopyable
{
protected:
	// *************************************************************************
	//	コンストラクタ
	NonCopyable() {}
	
	// *************************************************************************
	//	デストラクタ
	~NonCopyable() {}

private:
	// *************************************************************************
	//	コピーコンストラクタ
	NonCopyable( const NonCopyable& );
	
	// *************************************************************************
	//	代入演算子オペレータ
	NonCopyable& operator =( const NonCopyable& );

};


} // namespace nd

#endif // HPP_NONCOPYABLE_INCLUDED
