/* -------------------------------------------------------------------------------
	乱数　WELLアルゴリズム
---------------------------------------------------------------------------------*/

#ifndef HPP_RAND_WELL_INCLUDED
#define HPP_RAND_WELL_INCLUDED

namespace nd {

// =================================================================
//	WELLアルゴリズムによる擬似乱数
class RandWell {
// -----------------------------------------------------------------
//	コンストラクタ・デストラクタ
public:
	//	コンストラクタ
	explicit RandWell(
		const unsigned long seed	// I : 乱数の種
	);
	//	デストラクタ
	~RandWell();

// -----------------------------------------------------------------
//	公開メソッド
public:
	//	32bit 符号なし乱数取得
	unsigned long getU32();

// -----------------------------------------------------------------
//	メンバ変数
private:
	unsigned long state_[16];
	unsigned int index_;

};

} // namespace nd

#endif // HPP_RAND_WELL_INCLUDED
